RUS_ALPHABET = list('АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ')
WORDS = ['КАРМА', 'АКТИВ', 'АМЕБА', 'АРЕНА', 'АФЕРА', 'АЛИБИ', 'АНГЕЛ', 'АДЕПТ', 'БЕДРО', 'БИЗОН', 'БЛОХА',
         'БРЕМЯ', 'БУКВА', 'БУТОН', 'БУХТА', 'ВЕТЕР', 'ВЗНОС', 'ВИТОК', 'ГВАЛТ', 'ГЛИНА', 'ГОЛОД', 'ГОСТЬ',
         'ГУСАР', 'ГАЙКА', 'ГЕТРЫ', 'ГНАТЬ', 'ГОЛЬФ', 'ДЗЮДО', 'ДОЗОР', 'ДОТЛА', 'ДРОГИ', 'ДУХАН', 'ДЕБЮТ',
         'ДИНГО', 'ДОМНА', 'ДРАКА', 'ДУБЛЬ', 'ЕГЕРЬ', 'ЕГОЗА', 'ЕЗДОК', 'ЕСАУЛ', 'ЕЗДКА', 'ЕРЕСЬ', 'ЖИЗНЬ',
         'ЖУЧОК', 'ЖЕЛОБ', 'ЖИЛЬЕ', 'ЖЕРЛО', 'ЖОКЕЙ', 'ЖАЛКО', 'ЖИВОТ', 'ЗАЕЗД', 'ЗАМОК', 'ЗАСОВ',
         'ЗЕБРА', 'ЗАВЕТ', 'ЗАЙКА', 'ЗАПАЛ', 'ЗАТОР', 'ЗЕРНО', 'ИЖИЦА', 'ИЗВОЗ', 'ИГРЕЦ', 'ИЗЪЯН', 'ИСЛАМ',
         'ИЕРЕЙ', 'ИКОТА', 'КЕЛЬЯ', 'КИСТЬ', 'КОКОН', 'КОРОБ', 'КРУИЗ', 'ЛАВРА', 'ЛУЗГА', 'ЛАКЕЙ', 'ЛЕСТЬ',
         'МЕТОД', 'МОСОЛ', 'МУМИЯ', 'МЯМЛЯ', 'МЕРКА', 'МИДИЯ', 'НАЛИМ', 'НАТЕК', 'НОСОК', 'НАЖИГ', 'НАМЫВ',
         'ОБХОД', 'ОЗЕМЬ', 'ОКУНЬ', 'ОПЕКА', 'ОРГАН', 'ОСТОВ', 'ОТЕЛЬ', 'ПАНТЫ', 'ПЕПЕЛ', 'ПЕШКА', 'ПИТЬЕ',
         'ПЛИТА', 'ПОЛИВ', 'РУЛЕТ', 'РЫСАК', 'РОЯЛЬ', 'РУСЛО', 'СЪЕЗД', 'САЙКА', 'САРАЙ', 'СВЕЧА', 'СЕВЕР',
         'СКАРБ', 'СМЕРЧ', 'ТЕЛЕЦ', 'ТИПАЖ', 'ТРАКТ', 'ТРУБА', 'ТУРНЕ', 'УКЛАД', 'УГОРЬ', 'УЛИКА', 'УСПЕХ',
         'ФАКЕЛ', 'ФИРМА', 'ФАСАД', 'ФУГАС', 'ФИНАЛ', 'ХУТОР', 'ХАЛВА', 'ХОРЕЙ', 'ХАНЖА', 'ХЛЯБЬ', 'ХОХОТ',
         'ХОДОК', 'ЦОКОТ', 'ЦИФРА', 'ЦЕПКА', 'ЦИТРА', 'ЧЕЛКА', 'ЧУЖАК', 'ЧАБАН', 'ЧУЛОК', 'ЧАКРА', 'ШАЙБА',
         'ШКУРА', 'ШПИОН', 'ШТЫРЬ', 'ШМЕЛЬ', 'ЩЕКОТ', 'ЩЕТКА', 'ЩЕГОЛ', 'ЩЕПКА', 'ЩЕНОК', 'ЭТИКА', 'ЭСТЕТ',
         'ЭМАЛЬ', 'ЭСКИЗ', 'ЭЛИТА', 'ЭКРАН', 'ЮНИОР', 'ЮРИСТ', 'ЮНОША', 'ЮНКЕР', 'ЯГУАР', 'ЯСЕНЬ', 'ЯГОДА',
         'ЯХОНТ', 'ЯКОРЬ', 'ЯРЛЫК']

LETTER_ON_TRUE_POSITION_COLOR = 'rgb(40,181,22)'
LETTER_ON_ANOTHER_POSITION_COLOR = 'rgb(242,233,28)'
LETTER_NO_HAVE_POSITION_COLOR = 'lightgrey'